# PointCloudOverrides Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudOverrides Constructor
PointCloudOverrides Class See Also
---
Constructs empty overrides object.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public PointCloudOverrides()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
PointCloudOverrides()
```

# See Also
PointCloudOverrides Class
Autodesk.Revit.DB.PointClouds Namespace